{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "output_dim": 200, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 3000, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 3000]}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "output_dim": 50, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 100, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 100]}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "output_dim": 20, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 50, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 50]}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_3"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "output_dim": 1, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 20, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 20]}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_4"}}]}